julioosinski/toplavanderia/src/firmware/esp32PoltronaTemplate.ino
/**
 * ESP32 Poltrona de Massagem — Top Lavanderia
 * Versão atual: v1.3.7-toplav-poltrona
 * Perfil: timed_session — pending_commands action "on" / "off" via esp32-monitor
 *
 * Placeholders:
 *   __LAUNDRY_ID__  __MACHINE_NAME__  __DEFAULT_CYCLE_MINUTES__
 *
 * Hardware: Relé GPIO 26 (BC547 HIGH=liga) | DFPlayer TX16 RX17
 *
 * v1.3.7 — ON reentregue pulsa de novo se a sessão não estiver ativa (confirm HTTP falhou)
 * v1.3.5 — Compat Arduino-ESP32 3.x (esp_task_wdt_init com esp_task_wdt_config_t)
 * v1.3.4 — Auto-recuperação quando fica offline e não volta
 * v1.3.3 — Resfriamento pós-massagem (não bloqueante)
 * v1.3.2 — HTTPS com timeout + watchdog
 */

#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <HTTPClient.h>
#include <ArduinoJson.h>
#include <DFRobotDFPlayerMini.h>
#include <esp_task_wdt.h>
#include <Preferences.h>
#include <cstdio>
#include <esp_system.h>
#include "driver/gpio.h"
#include "soc/soc.h"
#include "soc/rtc_cntl_reg.h"

#define FIRMWARE_VERSION "v1.3.7-toplav-poltrona"

#define LAUNDRY_ID "__LAUNDRY_ID__"
#define MACHINE_NAME "__MACHINE_NAME__"
#define DEFAULT_CYCLE_MINUTES __DEFAULT_CYCLE_MINUTES__

#include "esp32_wifi_ota_common.h"

const char* supabaseUrl = "https://rkdybjzwiwwqqzjfmerm.supabase.co";
const char* supabaseApiKey =
    "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJzdXBhYmFzZSIsInJlZiI6InJrZHlianp3aXd3cXF6amZtZXJtIiwicm9sZSI6ImFub24iLCJpYXQiOjE3NTMzMDgxNjcsImV4cCI6MjA2ODg4NDE2N30.CnRP8lrmGmvcbHmWdy72ZWlfZ28cDdNoxdADnyFAOXg";

const int RELAY_PIN = 26;
const bool RELAY_LOGICA_INVERTIDA = false;

const unsigned long HEARTBEAT_INTERVAL_MS = 25000;
const unsigned long HEARTBEAT_RETRY_MS = 5000;
const unsigned long POLL_INTERVAL_MS = 8000;
const unsigned long HTTP_TIMEOUT_MS = 15000;
const unsigned long HTTP_CONNECT_TIMEOUT_MS = 4000;
const unsigned long RELAY_REASSERT_MS = 2000;
const unsigned long NET_STALE_RESTART_MS = 180000; // 3 min sem HTTPS OK ou sem Wi‑Fi (só fora da sessão)
const unsigned long SESSION_NET_QUIET_MS = 12000;  // após ligar motor: evita HTTPS imediato
const unsigned long WDT_TIMEOUT_S = 90;
const int NET_FAIL_RECONNECT = 3;
const int NET_FAIL_RESTART = 6;

/** Resfriamento: pausa (relé off) → motor 30s → off. Sem delay bloqueante. */
const unsigned long COOL_PAUSE_MS = 2000;
const unsigned long COOL_RUN_MS = 30000;
const int COOL_IDLE = 0;
const int COOL_PAUSE = 1;
const int COOL_RUN = 2;

HardwareSerial dfSerial(2);
DFRobotDFPlayerMini dfPlayer;
bool dfplayerDisponivel = false;

int volume_audio_001 = 27;
int volume_audio_002 = 27;
int volume_audio_003 = 27;
int volume_audio_004 = 27;
int volume_audio_005 = 27;
int volume_audio_006 = 27;
int volume_audio_007 = 18;

unsigned long tempo_inicio_audios = 0;
unsigned long ultimo_play_audio_007 = 0;
int proximoAudioNum = 0;
const unsigned long AUDIO_007_LOOP_MS = 70000;
const unsigned long AUDIO_007_DURACAO_MS = 599000;

String statusAtual = "disponivel";
unsigned long tempoInicioCiclo = 0;
unsigned long tempoTotalSeg = 0;
unsigned long tempoRestanteSeg = 0;
unsigned long sessionEndsAtMs = 0;
unsigned long ultimoDesligamento = 0;
const unsigned long COOLDOWN_MS = 2000;
int coolPhase = COOL_IDLE;
unsigned long coolPhaseStartedAt = 0;

char ESP32_ID[16];
unsigned long lastHeartbeat = 0;
unsigned long lastPoll = 0;
unsigned long lastRelayReassert = 0;
unsigned long lastNetOkMs = 0;
unsigned long wifiDownSinceMs = 0;
unsigned long sessionMotorStartedAt = 0;
int netFailCount = 0;
const char* lastResetReason = "unknown";
String lastExecutedCommandId = "";
Preferences sessionPrefs;
int relayAppliedLevel = -1;
bool relayPinReady = false;

bool sendHeartbeat();
bool confirmCommand(const char* commandId);

void wdtKick() {
  esp_task_wdt_reset();
}

void setupWatchdog() {
  // Se TLS/HTTPS travar (timeout não respeitado), o WDT reinicia o ESP.
  // Sessão ativa é restaurada do NVS — a massagem não “some” no reboot.
  // Arduino-ESP32 3.x / ESP-IDF 5: esp_task_wdt_init(const esp_task_wdt_config_t*).
  esp_task_wdt_deinit();
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  // idle_core_mask=0: não vigia idle tasks (TLS longo + idle WDT = reboot no meio da massagem).
  esp_task_wdt_config_t wdtConfig = {
    .timeout_ms = static_cast<uint32_t>(WDT_TIMEOUT_S * 1000UL),
    .idle_core_mask = 0,
    .trigger_panic = true,
  };
  esp_task_wdt_init(&wdtConfig);
#else
  esp_task_wdt_init(WDT_TIMEOUT_S, true);
#endif
  esp_task_wdt_add(NULL);
}

const char* describeResetReason() {
  switch (esp_reset_reason()) {
    case ESP_RST_POWERON: return "poweron";
    case ESP_RST_SW: return "software";
    case ESP_RST_PANIC: return "panic";
    case ESP_RST_INT_WDT: return "int_wdt";
    case ESP_RST_TASK_WDT: return "task_wdt";
    case ESP_RST_WDT: return "wdt";
    case ESP_RST_BROWNOUT: return "brownout";
    default: return "unknown";
  }
}

void noteNetOk() {
  lastNetOkMs = millis();
  netFailCount = 0;
}

void noteNetFail() {
  netFailCount++;
  Serial.printf("Falha de rede #%d\n", netFailCount);
}

void loadLastExecutedCommandId() {
  sessionPrefs.begin("poltrona_cmd", true);
  lastExecutedCommandId = sessionPrefs.getString("last_id", "");
  sessionPrefs.end();
}

void markCommandExecuted(const String& cmdId) {
  lastExecutedCommandId = cmdId;
  sessionPrefs.begin("poltrona_cmd", false);
  sessionPrefs.putString("last_id", cmdId);
  sessionPrefs.end();
}

bool peekPersistedSessionActive() {
  sessionPrefs.begin("poltrona_sess", true);
  bool active = sessionPrefs.getBool("active", false);
  unsigned long remain = sessionPrefs.getULong("remain_s", 0);
  sessionPrefs.end();
  return active && remain >= 15;
}

void clearPersistedSession() {
  sessionPrefs.begin("poltrona_sess", false);
  sessionPrefs.clear();
  sessionPrefs.end();
}

void persistActiveSession() {
  if (statusAtual != "em_uso" || tempoRestanteSeg == 0) {
    clearPersistedSession();
    return;
  }
  sessionPrefs.begin("poltrona_sess", false);
  sessionPrefs.putBool("active", true);
  sessionPrefs.putULong("remain_s", tempoRestanteSeg);
  sessionPrefs.putULong("saved_at_ms", millis());
  sessionPrefs.end();
}

void buildEsp32Id() {
  WiFi.mode(WIFI_STA);
  delay(50);
  uint8_t mac[6];
  WiFi.macAddress(mac);
  snprintf(ESP32_ID, sizeof(ESP32_ID), "esp32_%02x%02x%02x%02x", mac[2], mac[3], mac[4], mac[5]);
}

/** Relé GPIO26 (ADC2): hold só na transição — Wi‑Fi glitcha o pino sem hold. */
void ensureRelayPinMode() {
  if (relayPinReady) return;
  pinMode(RELAY_PIN, OUTPUT);
  relayPinReady = true;
}

