julioosinski/toplavanderia/src/firmware/esp32PoltronaTemplate.ino
void acionarRele(bool ligar) {
  int nivel = ligar
    ? (RELAY_LOGICA_INVERTIDA ? LOW : HIGH)
    : (RELAY_LOGICA_INVERTIDA ? HIGH : LOW);
  // Hold SÓ na transição: trava GPIO26 contra glitch do Wi‑Fi (ADC2).
  // Não chamar hold_dis/en a cada loop — isso causava rst:int_wdt.
  gpio_hold_dis((gpio_num_t)RELAY_PIN);
  ensureRelayPinMode();
  digitalWrite(RELAY_PIN, nivel);
  if (ligar) {
    gpio_hold_en((gpio_num_t)RELAY_PIN);
  }
  relayAppliedLevel = nivel;
  lastRelayReassert = millis();
}

bool relayShouldBeOn() {
  return statusAtual == "em_uso" || coolPhase == COOL_RUN;
}

bool inSessionNetQuiet() {
  if (sessionMotorStartedAt == 0) return false;
  if (statusAtual != "em_uso" && coolPhase == COOL_IDLE) return false;
  return (millis() - sessionMotorStartedAt) < SESSION_NET_QUIET_MS;
}

void reassertRelayIfSession() {
  if (!relayShouldBeOn()) return;
  unsigned long now = millis();
  if (lastRelayReassert != 0 && (now - lastRelayReassert) < RELAY_REASSERT_MS) return;
  // Reafirma HIGH sem martelar pinMode; hold breve protege contra ADC2/Wi‑Fi.
  gpio_hold_dis((gpio_num_t)RELAY_PIN);
  digitalWrite(RELAY_PIN, RELAY_LOGICA_INVERTIDA ? LOW : HIGH);
  gpio_hold_en((gpio_num_t)RELAY_PIN);
  relayAppliedLevel = RELAY_LOGICA_INVERTIDA ? LOW : HIGH;
  lastRelayReassert = now;
}

void pararAudio() {
  proximoAudioNum = 0;
  tempo_inicio_audios = 0;
  ultimo_play_audio_007 = 0;
  if (dfplayerDisponivel) {
    dfPlayer.pause();
  }
}

void cancelCooling() {
  coolPhase = COOL_IDLE;
  coolPhaseStartedAt = 0;
}

void startCooling() {
  // Massagem já desligada → pausa 2s → liga 30s → desliga (tudo no loop, sem delay).
  coolPhase = COOL_PAUSE;
  coolPhaseStartedAt = millis();
  sessionMotorStartedAt = 0;
  acionarRele(false);
  Serial.println("Resfriamento: pausa 2s, depois 30s ligados");
}

void atualizarResfriamento() {
  if (coolPhase == COOL_IDLE) return;
  unsigned long now = millis();
  if (coolPhase == COOL_PAUSE) {
    if (now - coolPhaseStartedAt >= COOL_PAUSE_MS) {
      coolPhase = COOL_RUN;
      coolPhaseStartedAt = now;
      acionarRele(true);
      Serial.println("Resfriamento: motor ON 30s");
    }
  } else if (coolPhase == COOL_RUN) {
    if (now - coolPhaseStartedAt >= COOL_RUN_MS) {
      acionarRele(false);
      cancelCooling();
      ultimoDesligamento = millis();
      Serial.println("Resfriamento concluído");
      sendHeartbeat();
      lastHeartbeat = millis();
    }
  }
}

/** Encerra a massagem. comResfriamento=true: ciclo pausa+30s (fim natural ou Parar). */
void pararPoltrona(bool comResfriamento) {
  pararAudio();
  clearPersistedSession();
  statusAtual = "disponivel";
  tempoTotalSeg = 0;
  tempoRestanteSeg = 0;
  tempoInicioCiclo = 0;
  sessionEndsAtMs = 0;
  sessionMotorStartedAt = 0;
  acionarRele(false);
  if (comResfriamento) {
    startCooling();
  } else {
    cancelCooling();
    ultimoDesligamento = millis();
  }
}

bool restorePersistedSession() {
  sessionPrefs.begin("poltrona_sess", true);
  bool active = sessionPrefs.getBool("active", false);
  unsigned long remain = sessionPrefs.getULong("remain_s", 0);
  sessionPrefs.end();
  if (!active || remain < 15) {
    clearPersistedSession();
    return false;
  }
  tempoTotalSeg = remain;
  tempoRestanteSeg = remain;
  tempoInicioCiclo = millis();
  sessionEndsAtMs = millis() + (remain * 1000UL);
  statusAtual = "em_uso";
  acionarRele(true);
  sessionMotorStartedAt = millis();
  proximoAudioNum = 7;
  tempo_inicio_audios = millis() > AUDIO_007_LOOP_MS ? (millis() - AUDIO_007_LOOP_MS) : 0;
  ultimo_play_audio_007 = millis();
  Serial.printf("Sessão restaurada — %lu s restantes\n", remain);
  return true;
}

bool iniciarPoltrona(int tempoMinutos) {
  if (tempoMinutos <= 0) tempoMinutos = DEFAULT_CYCLE_MINUTES;

  // Novo pagamento durante resfriamento: cancela o cool e inicia a sessão.
  if (coolPhase != COOL_IDLE) {
    cancelCooling();
    acionarRele(false);
  }

  if (statusAtual == "em_uso") {
    unsigned long adicional = (unsigned long)tempoMinutos * 60UL;
    tempoTotalSeg += adicional;
    tempoRestanteSeg += adicional;
    sessionEndsAtMs = (sessionEndsAtMs == 0)
      ? (millis() + tempoRestanteSeg * 1000UL)
      : (sessionEndsAtMs + adicional * 1000UL);
    persistActiveSession();
    acionarRele(true);
    sessionMotorStartedAt = millis();
    return true;
  }

  if (ultimoDesligamento > 0 && (millis() - ultimoDesligamento) < COOLDOWN_MS) {
    delay(COOLDOWN_MS - (millis() - ultimoDesligamento));
  }

  tempoTotalSeg = (unsigned long)tempoMinutos * 60UL;
  if (tempoTotalSeg < 1150UL) tempoTotalSeg = 1150UL;

  acionarRele(true);
  statusAtual = "em_uso";
  tempoInicioCiclo = millis();
  tempoRestanteSeg = tempoTotalSeg;
  sessionEndsAtMs = millis() + (tempoTotalSeg * 1000UL);
  sessionMotorStartedAt = millis();
  proximoAudioNum = 0;
  Serial.printf("Poltrona ON — %lu s (%d min)\n", tempoTotalSeg, tempoMinutos);
  persistActiveSession();
  // Estabiliza alimentação do motor antes do 1º HTTPS (confirm).
  delay(250);
  reassertRelayIfSession();
  return true;
}

void gerenciarAudios() {
  if (statusAtual != "em_uso" || !dfplayerDisponivel) return;

  if (proximoAudioNum == 0) {
    dfPlayer.volume(volume_audio_001);
    delay(80);
    dfPlayer.play(1);
    tempo_inicio_audios = millis();
    proximoAudioNum = 1;
    return;
  }

  unsigned long elapsed = millis() - tempo_inicio_audios;
  if (elapsed >= 4000 && proximoAudioNum == 1) {
    dfPlayer.volume(volume_audio_002); delay(50); dfPlayer.play(2); proximoAudioNum = 2;
  } else if (elapsed >= 10000 && proximoAudioNum == 2) {
    dfPlayer.volume(volume_audio_003); delay(50); dfPlayer.play(3); proximoAudioNum = 3;
  } else if (elapsed >= 20000 && proximoAudioNum == 3) {
    dfPlayer.volume(volume_audio_004); delay(50); dfPlayer.play(4); proximoAudioNum = 4;
  } else if (elapsed >= 30000 && proximoAudioNum == 4) {
    dfPlayer.volume(volume_audio_005); delay(50); dfPlayer.play(5); proximoAudioNum = 5;
  } else if (elapsed >= 50000 && proximoAudioNum == 5) {
    dfPlayer.volume(volume_audio_006); delay(50); dfPlayer.play(6); proximoAudioNum = 6;
  } else if (elapsed >= AUDIO_007_LOOP_MS && proximoAudioNum == 6) {
    dfPlayer.volume(volume_audio_007); delay(50); dfPlayer.play(7);
    proximoAudioNum = 7; ultimo_play_audio_007 = millis();
  } else if (proximoAudioNum == 7) {
    unsigned long loopElapsed = elapsed - AUDIO_007_LOOP_MS;
    if (loopElapsed >= 18UL * 60UL * 1000UL) {
      dfPlayer.pause();
      proximoAudioNum = 8;
    } else if (ultimo_play_audio_007 > 0 && (millis() - ultimo_play_audio_007) >= AUDIO_007_DURACAO_MS) {
      dfPlayer.volume(volume_audio_007); delay(50); dfPlayer.play(7);
      ultimo_play_audio_007 = millis();
    }
  }
}

void atualizarTimerSessao() {
  if (statusAtual != "em_uso" || sessionEndsAtMs == 0) return;
  unsigned long now = millis();
  if (now >= sessionEndsAtMs) {
    Serial.println("Tempo esgotado — resfriamento");
    pararPoltrona(true);
    sendHeartbeat();
    lastHeartbeat = millis();
    return;
  }
  tempoRestanteSeg = (sessionEndsAtMs - now) / 1000UL;
  static unsigned long lastPersistMs = 0;
  if (lastPersistMs == 0 || (now - lastPersistMs) >= 10000UL) {
    persistActiveSession();
    lastPersistMs = now;
  }
}

